Revit 2026 API

# ExportLinetypeTable Properties

---

The ExportLinetypeTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Item | A copy of the ExportLinetypeInfo for the linetype's ExportLinetypeKey. |

#### Reference

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace